# VS Code Extensions
# Install with: cat extensions.txt | xargs -L 1 code --install-extension

# Themes & Icons
chadalen.vscode-jetbrains-icon-theme
github.github-vscode-theme
miguelsolorio.symbols

# Git
codezombiech.gitignore
github.vscode-github-actions

# JavaScript/TypeScript/React
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
esbenp.prettier-vscode
rvest.vs-code-prettier-eslint
standard.vscode-standard

# Vue
vue.volar

# CSS
csstools.postcss
syler.sass-indented

# Python
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs

# Elixir/Phoenix
jakebecker.elixir-ls
phoenixframework.phoenix

# PHP/Laravel
biati.ddev-manager
laravel.vscode-laravel

# Database
prisma.prisma

# Docker & Remote
docker.docker
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers

# Testing
vitest.explorer

# Utilities
aaron-bond.better-comments
editorconfig.editorconfig
firefox-devtools.vscode-firefox-debug
mikestead.dotenv
ms-vscode.makefile-tools
yzhang.markdown-all-in-one

# AI
anthropic.claude-code